# Pandas üêº
<pre><b>Pandas is a python library which is used to analyze and mannipulate data.
    We can also create and read datasets using pandas.
Pandas is of two types:
    <li>one is series (single column)</li>
<li>Dataframe (multiple columns)</li></pre>

In [1]:
import pandas as pd

In [2]:
#creating a series
s=pd.Series(['a','b','c','d'])
s

0    a
1    b
2    c
3    d
dtype: object

In [3]:
type(s)

pandas.core.series.Series

In [9]:
s=pd.Series(['a','b','c','d'],index=[10,20,20,40])
s

10    a
20    b
20    c
40    d
dtype: object

In [10]:
#indexing
s[10]

'a'

In [11]:
s[20]

20    b
20    c
dtype: object

In [14]:
#slicing
s[1::]

20    b
20    c
40    d
dtype: object

In [15]:
s[0:3:2]

10    a
20    c
dtype: object

In [16]:
s[1::2]

20    b
40    d
dtype: object

In [17]:
#Tuple to series
t=pd.Series((100,200,300,400))
t

0    100
1    200
2    300
3    400
dtype: int64

In [19]:
#set to series
a=pd.Series({10,20,30,40}) #we cant create a series using set
a

TypeError: 'set' type is unordered

In [20]:
#Dictionary to series
d=pd.Series({'a' : 1,'b' : 2,'c' :3,'d' :4})
d

a    1
b    2
c    3
d    4
dtype: int64

In [25]:
d1=pd.Series({'a' : 1,'b' : 2,'c' :3,'d' :4},index=['a','b','c','d'])
d1

a    1
b    2
c    3
d    4
dtype: int64

In [26]:
#indeixing
d[1]

C:\Users\Dell\AppData\Local\Temp\ipykernel_23000\4133984012.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  d[1]

2

In [27]:
#slicing
d[1::2]

b    2
d    4
dtype: int64

In [31]:
d['b':'d':2]

b    2
d    4
dtype: int64

In [73]:
#Creating a DataFrame
#By using dictionary we can create a DataFrame
d={'Name':['Ram','Siya','Nandini','Jyoo','Vishnu'],'Roll':[111,222,333,444,555],'Course':['AIML','Python','AIML','AIML','AIML']}
d

{'Name': ['Ram', 'Siya', 'Nandini', 'Jyoo', 'Vishnu'],
 'Roll': [111, 222, 333, 444, 555],
 'Course': ['AIML', 'Python', 'AIML', 'AIML', 'AIML']}

In [74]:
df = pd.DataFrame(d,index=[1,2,3,4,5])
df

      Name  Roll  Course
1      Ram   111    AIML
2     Siya   222  Python
3  Nandini   333    AIML
4     Jyoo   444    AIML
5   Vishnu   555    AIML

In [75]:
df=pd.DataFrame(d,index=range(1,6))
df

      Name  Roll  Course
1      Ram   111    AIML
2     Siya   222  Python
3  Nandini   333    AIML
4     Jyoo   444    AIML
5   Vishnu   555    AIML

In [76]:
#Indexing
df.Name[3]

'Nandini'

In [77]:
df.Course[3]

'AIML'

In [78]:
df.Roll[3]

333

In [79]:
#head - it represents top rows (by default 5)
df.head(3)

      Name  Roll  Course
1      Ram   111    AIML
2     Siya   222  Python
3  Nandini   333    AIML

In [80]:
#tail - it represents bottom rows (by default 5)
df.tail(3)

      Name  Roll Course
3  Nandini   333   AIML
4     Jyoo   444   AIML
5   Vishnu   555   AIML

In [81]:
#iloc
df.iloc[::,::]

      Name  Roll  Course
1      Ram   111    AIML
2     Siya   222  Python
3  Nandini   333    AIML
4     Jyoo   444    AIML
5   Vishnu   555    AIML

In [82]:
df.iloc[3,::]

Name      Jyoo
Roll       444
Course    AIML
Name: 4, dtype: object

In [83]:
df.iloc[2,::]

Name      Nandini
Roll          333
Course       AIML
Name: 3, dtype: object

In [84]:
df.iloc[::,0:3:2]

      Name  Course
1      Ram    AIML
2     Siya  Python
3  Nandini    AIML
4     Jyoo    AIML
5   Vishnu    AIML

In [85]:
df.iloc[0::2,0::2]

      Name Course
1      Ram   AIML
3  Nandini   AIML
5   Vishnu   AIML

In [86]:
df=df.rename(columns = {'Name':'Stu_Name'})
df

  Stu_Name  Roll  Course
1      Ram   111    AIML
2     Siya   222  Python
3  Nandini   333    AIML
4     Jyoo   444    AIML
5   Vishnu   555    AIML

In [87]:
#set_index
df.set_index('Roll',inplace=True)
df

     Stu_Name  Course
Roll
111       Ram    AIML
222      Siya  Python
333   Nandini    AIML
444      Jyoo    AIML
555    Vishnu    AIML

In [97]:
import numpy as np
d = pd.DataFrame({'Days':[1,2,3,4,5],'Places':['Puri',np.NaN,'Munnar','Siripuram','Kerala'],'Visitors':[2000,3000,6000,1000,5000]})
d

   Days     Places  Visitors
0     1       Puri      2000
1     2        NaN      3000
2     3     Munnar      6000
3     4  Siripuram      1000
4     5     Kerala      5000

In [98]:
#to check the misssing values
d.isnull()

    Days  Places  Visitors
0  False   False     False
1  False    True     False
2  False   False     False
3  False   False     False
4  False   False     False

In [99]:
d.isnull().sum()

Days        0
Places      1
Visitors    0
dtype: int64

In [100]:
#fillna
d.Places.fillna('Puri',inplace=True)
d

C:\Users\Dell\AppData\Local\Temp\ipykernel_23000\656463471.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  d.Places.fillna('Puri',inplace=True)

   Days     Places  Visitors
0     1       Puri      2000
1     2       Puri      3000
2     3     Munnar      6000
3     4  Siripuram      1000
4     5     Kerala      5000

In [101]:
#to check datatypes
d.dtypes

Days         int64
Places      object
Visitors     int64
dtype: object

In [102]:
#information (info)
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Days      5 non-null      int64
 1   Places    5 non-null      object
 2   Visitors  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [104]:
d.Places.unique()

array(['Puri', 'Munnar', 'Siripuram', 'Kerala'], dtype=object)

In [105]:
d.Visitors.mean()

3400.0

In [106]:
d.Visitors.max()

6000

In [109]:
d.describe(include='all') #for all purpose including strings

            Days Places     Visitors
count   5.000000      5     5.000000
unique       NaN      4          NaN
top          NaN   Puri          NaN
freq         NaN      2          NaN
mean    3.000000    NaN  3400.000000
std     1.581139    NaN  2073.644135
min     1.000000    NaN  1000.000000
25%     2.000000    NaN  2000.000000
50%     3.000000    NaN  3000.000000
75%     4.000000    NaN  5000.000000
max     5.000000    NaN  6000.000000